app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES(NULL, '2010-05-25 17:48:11', '2010-05-25 17:48:11')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 980190962)